https://github.com/okovtun/BV_225.git
https://www.youtube.com/watch?v=owJLioIXPds&list=PLeqyOOqxeiIOn6FFT2a2xBVF9UpViJ-WH

TODO:
Написать программу "Калькулятор", которая принимает выражение вида
	2 + 3
и выдает результат следующим образом:
	2 + 3 = 5

DONE:
Что будет выведено на экран в седующиъх случаях:
1.	int i = 3;
	i = ++i + ++i;
	cout << i << endl;
2.	int i = 3;
	i = i++ + 1 + ++i * 2;
	cout << i << endl;
3.	int i = 3;
	i = ++i + 1 + ++i *= 2;
	cout << i << endl;
4.	int i = 3;
	i += ++i + 1 + ++i *= 2;
	cout << i << endl;
!!!!!!!!!! Все эти задачи нужно решать без Visual Studio, и в VS лишь проверять результат.
Результаты на каждую задачу прислать в текстовом файле!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

DONE:
Решить все задачи из файла: https://raw.githubusercontent.com/okovtun/BV_225/master/DataTypes/VariablesTask.pdf


DONE:
1. Выучить теорию по типам данных!!!!!!!!!!!!!!!!!!!!!!!!!
----------------------------------------------------------
2. Используя оператор sizeof() и макроопределения Visual Studio
   вывести на экран объем занимаемой памяти и диапазоны принимаемых значений
   все целочисленных типов данных.
3. *Поменять местами две переменные:
	int a=2;
	int b=3;
	cout << a << "\t" << b << endl; //	2	3
	....
	код, меняющий местами переменные a и b
	....
	cout << a << "\t" << b << endl; //	3	2
4. Решить все задачи из файла: https://raw.githubusercontent.com/okovtun/BV_225/master/DataTypes/VariablesTask.pdf

TODO:
1. Выучить теорию!
2. Создать проект Elochka, и в этом проэкте вывести в консоль стишок
   "В лесу родилась Ёлочка". Стишок должен быть выровнен по середине экрана,
   и его куплеты должны быть разделены пустой строкой;

TOREAD:
https://en.cppreference.com/w/c/language/escape
https://docs.microsoft.com/en-us/cpp/c-language/escape-sequences?view=msvc-170