https://github.com/okovtun/BV_225.git
https://www.youtube.com/watch?v=owJLioIXPds&list=PLeqyOOqxeiIOn6FFT2a2xBVF9UpViJ-WH

TOREAD:
https://www.softelectro.ru/ieee754.html

Book:
https://drive.google.com/drive/folders/1mIhAKMp5-Jpy6s5X8u924tRCXFEdHE_z

TODO:
0. Выучить теорию по функциям!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
1. В проект Functions добавить функцию ??? Power(???), которая возводит указанное число 
   в указанную степень;

TODO:
1. В проекте Random обеспечить генерацию случайных чисел в заданном диапазоне,
   который пользователь вводит с клавиатуры;
2. В проекте Random массив, заполненный случайными числами отсортировать в порядке возрастания
   и вывести на экран отсортированный массив;
3. В Solution Arrays добавить проект UniqueRandom, и в этом проекте заполнить массив из десяти элементов
   униакльными случайными числами в диапазоне от 70 до 80;

DONE:
1. Есть массив из десяти элементов, проинициализированный рядом чисел
	1	2	3	4	5	6	7	8	9	10
   Необходимо выполнить циклический сдвиг влево массива на заданное число элементов.
	2	3	4	5	6	7	8	9	10	1
	3	4	5	6	7	8	9	10	1	2
	4	5	6	7	8	9	10	1	2	3
2. Выполнить циклический сдвиг массива вправо, на заданное число элементов;
3. Десятичное число, введенное с клавиатуры перевести в двоичную систему счисления;
4. Десятичное число, введенное с клавиатуры перевести в шестнадцатеричную систему счисления;
	Алгоритм перевода Dec в Bin и Hex здесь:
	https://github.com/okovtun/BV_225/blob/master/DataTypes/NumericSystems.pdf

DONE:
1. Ввести значения элементов массива с клавиатуры;	DONE
2. Вывести массив на экран;							DONE
3. Вывести массив на экран в обратном порядке;		DONE
4. Вычислить сумму элементов массива;				DONE
5. Вычислить сумму среднее-арифметическое массива;	DONE
6. Найти минимальное значение в массиве;			DONE
7. Найти максимальное значение в массиве;			DONE

DONE:
Выбрать пять любых проектов, сделать из них репозитории и залить эти репозитории на GitHub.
В качестве отчета прислать ссылку на свой GitHub;

DONE:
1. Вывести на экран таблицу Пифагора;
2. Используя вложенные циклы вывести на экран следующие фигуры:
   https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/Geometria1.txt
   Размер фигуры должен вводить пользователь.
3. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/ChessBoard.jpg
4. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/HardChess.jpg

DONE:
1. Пользователь вводит число с клавиатуры, а программа вычисляет факториал этого числа;
	5! = 1*2*3*4*5 = 120;
2. Пользователь вводит с клавиатуры два числа - оснвание и показатель степени, 
   и программа возводит число в степень;
3. Вывести на экран таблицу ASCII-символов по 16 символов в строке,
   символы должны разделяться пробелом;
4. Вывести на экран ряд Фибоначчи до указанного предела.
   Предел вводит пользователь с клавиатуры;
   Например до 10:
	0	1	1	2	3	5	8	//13 уже НЕ выводится
5. Вывести на экран заданное количество чисел из ряда Фибоначчи;
   Например 10 чисел:
	0	1	1	2	3	5	8	13	21	34
6. Вывести на экран ряд простых чисел до указанного предела.
   Простым называется число, которое делится только на себя и на 1.

DONE:
1. Написать программу Shooter, которая по нажатой клавише определяет действие пользователя:
	w - вперед
	s - назад
	a - влево
	d - вправо
	space - прыжок
	enter - огонь
	Если ползователь нажал не ту клавишу, на экран выводится Error.

DONE:
1. Пользователь вводит число. Программа говорит, является ли введенное число палиндромом.
   Палиндром - это число, которое читается одинаково, как слева направо, так и справа налево.

DONE:
1. Написать такой же калькулятор, только при помощи switch;
2. Ползователь вводит номер автобусного билета, и программа должна сказать,
   этот билет счастливый или обычный;

DONE:
Написать программу "Калькулятор", которая принимает выражение вида
	2 + 3
и выдает результат следующим образом:
	2 + 3 = 5

DONE:
Что будет выведено на экран в седующиъх случаях:
1.	int i = 3;
	i = ++i + ++i;
	cout << i << endl;
2.	int i = 3;
	i = i++ + 1 + ++i * 2;
	cout << i << endl;
3.	int i = 3;
	i = ++i + 1 + ++i *= 2;
	cout << i << endl;
4.	int i = 3;
	i += ++i + 1 + ++i *= 2;
	cout << i << endl;
!!!!!!!!!! Все эти задачи нужно решать без Visual Studio, и в VS лишь проверять результат.
Результаты на каждую задачу прислать в текстовом файле!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

DONE:
Решить все задачи из файла: https://raw.githubusercontent.com/okovtun/BV_225/master/DataTypes/VariablesTask.pdf


DONE:
1. Выучить теорию по типам данных!!!!!!!!!!!!!!!!!!!!!!!!!
----------------------------------------------------------
2. Используя оператор sizeof() и макроопределения Visual Studio
   вывести на экран объем занимаемой памяти и диапазоны принимаемых значений
   все целочисленных типов данных.
3. *Поменять местами две переменные:
	int a=2;
	int b=3;
	cout << a << "\t" << b << endl; //	2	3
	....
	код, меняющий местами переменные a и b
	....
	cout << a << "\t" << b << endl; //	3	2
4. Решить все задачи из файла: https://raw.githubusercontent.com/okovtun/BV_225/master/DataTypes/VariablesTask.pdf

TODO:
1. Выучить теорию!
2. Создать проект Elochka, и в этом проэкте вывести в консоль стишок
   "В лесу родилась Ёлочка". Стишок должен быть выровнен по середине экрана,
   и его куплеты должны быть разделены пустой строкой;

TOREAD:
https://en.cppreference.com/w/c/language/escape
https://docs.microsoft.com/en-us/cpp/c-language/escape-sequences?view=msvc-170